project phase 2/Performance testing/Result/Stress_testing.txt
✗ /t/general status is 200
      ↳  3% — ✓ 1924 / ✗ 48393
     ✗ /t/general response time < 200
      ↳  85% — ✓ 43160 / ✗ 7157
     ✗ Main page status is 200
      ↳  3% — ✓ 1745 / ✗ 48445
     ✗ Main page response time < 200ms
      ↳  86% — ✓ 43360 / ✗ 6830
     ✗ /t/general?sort=top status is 200
      ↳  3% — ✓ 1723 / ✗ 48300
     ✗ /t/general?sort=top response time < 200
      ↳  86% — ✓ 43224 / ✗ 6799
     ✗ /t/general?sort=newest status is 200
      ↳  3% — ✓ 1662 / ✗ 48176
     ✗ /t/general?sort=newest response time < 200
      ↳  86% — ✓ 42998 / ✗ 6840
     ✗ /t/general?sort=oldest status is 200
      ↳  3% — ✓ 1588 / ✗ 48066
     ✗ /t/general?sort=oldest response time < 200
      ↳  86% — ✓ 42931 / ✗ 6723
checks.........................: 44.85% 224315 out of 500044
     data_received..................: 305 MB 678 kB/s
     data_sent......................: 25 MB  56 kB/s
     http_req_blocked...............: avg=28.23ms  min=0s      med=0s      max=15.05s   p(90)=0s       p(95)=0s
     http_req_connecting............: avg=28.22ms  min=0s      med=0s      max=15.05s   p(90)=0s       p(95)=0s
     http_req_duration..............: avg=814.05ms min=0s      med=32.92ms max=51.69s   p(90)=229.93ms p(95)=310.17ms
       { expected_response:true }...: avg=21.41s   min=72.71ms med=25.94s  max=51.69s   p(90)=29.29s   p(95)=29.83s
     http_req_failed................: 96.54% 241380 out of 250022
     http_req_receiving.............: avg=302.06µs min=0s      med=0s      max=100.57ms p(90)=489.1µs  p(95)=853.8µs
     http_req_sending...............: avg=4.06µs   min=0s      med=0s      max=6.01ms   p(90)=0s       p(95)=0s
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s
     http_req_waiting...............: avg=813.74ms min=0s      med=32.86ms max=51.69s   p(90)=229.88ms p(95)=310.17ms
     http_reqs......................: 250022 555.603967/s
     iteration_duration.............: avg=6.99s    min=1.01s   med=1.29s   max=2m23s    p(90)=27.72s   p(95)=43.09s
     iterations.....................: 49644  110.319905/s
     vus............................: 2      min=2                max=1500
     vus_max........................: 1500   min=1500             max=1500


running (7m30.0s), 0000/1500 VUs, 49644 complete and 674 interrupted iterations
default ✓ [======================================] 0000/1500 VUs  7m0s